src/Catalogs/ИС_Ozon_ЗначенияХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_Ozon_ЗначенияХарактеристик</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИС_Ozon_Характеристики</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_ЗначенияХарактеристикПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_ЗначенияХарактеристикПоКатегориям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Характеристики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_ЗначенияХарактеристик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ИС_Ozon_ЗначенияХарактеристик/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Категория = Неопределено;
	Характеристика = Неопределено;
	Параметры.Свойство("Категория", Категория);
	Параметры.Свойство("Характеристика", Характеристика);

	Если ЗначениеЗаполнено(Характеристика) И ЗначениеЗаполнено(Категория) Тогда

		МассивЗначений = РегистрыСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям.ЗначенияХарактеристик(Категория,
			Характеристика);

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", МассивЗначений,
			ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	КонецЕсли;

КонецПроцедуры 

//+ ИнфоСофт Заварин К.В. 02.11.24 УА #83978
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборХарактеристики" Тогда
				
		ДобавитьХарактеристикиВСписок(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 02.11.24 УА #83978

#КонецОбласти  

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Заварин К.В. 02.11.24 УА #83978
&НаКлиенте
Процедура ИзменитьХарактеристику(Команда) 
	
	ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаИзмененияХарактеристики", , , , , , ,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 02.11.24 УА #83978


#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Заварин К.В. 02.11.24 УА #83978
&НаСервере
Процедура ДобавитьХарактеристикиВСписок(Параметр)
	
	Характеристика  = Неопределено;
	Категория 		= Неопределено;
	
	Параметр.Свойство("Характеристика", Характеристика);
	Параметр.Свойство("Категория", 		Категория);
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		
		МассивЗначений = РегистрыСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям.ЗначенияХарактеристик(Категория,
		Характеристика);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", МассивЗначений,
		ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		
	КонецЕсли;	                
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 02.11.24 УА #83978

#КонецОбласти
